
{
  "sidebar_share_label": "Chia sẻ hoặc kết nối",
  "header_home": "TRANG CHỦ",
  "header_upscale": "UPSCALE",
  "header_utilities": "TIỆN ÍCH",
  "header_history": "CTAIVID",
  "header_guide": "HƯỚNG DẪN",
  "header_admin_manage": "QUẢN LÝ",
  "header_admin_users": "QUẢN LÝ NGƯỜI DÙNG",
  "header_settings": "CÀI ĐẶT",
  "header_login": "ĐĂNG NHẬP",
  "header_logout": "ĐĂNG XUẤT",
  "header_subtitle": "Kiến tạo bằng trí tuệ nhân tạo",
  "favorites_empty_title": "Không có công cụ yêu thích nào",
  "favorites_empty_desc": "Nhấn vào ngôi sao trên một công cụ để thêm nó vào đây.",
  "tool_card_locked_badge": "Khóa",
  "tool_card_locked_alert": "Công cụ này đã bị khóa bởi quản trị viên.",
  "tool_card_develop_alert": "Công cụ này đang được phát triển!",
  "tool_card_unlock_label": "Mở khóa công cụ",
  "tool_card_lock_label": "Khóa công cụ",
  "tool_card_add_fav_label": "Thêm vào yêu thích",
  "tool_card_remove_fav_label": "Xóa khỏi yêu thích",
  "tool_card_open_label": "Mở công cụ: {title}",
  "chatbot_welcome": "Xin chào! ctai.arch có thể giúp gì cho bạn?",
  "chatbot_sent_image": "Đã gửi một ảnh.",
  "chatbot_error": "Rất tiếc, đã có lỗi xảy ra. Vui lòng thử lại.",
  "chatbot_title": "Trợ lý AI",
  "chatbot_coffee_banner": "Hãy mời tôi 1 ly coffe: MB bank: 0589338888. Cảm ơn sự ủng hộ của bạn!",
  "chatbot_placeholder": "Nhập câu hỏi của bạn...",
  "chatbot_attach_label": "Đính kèm tệp",
  "chatbot_send_label": "Gửi tin nhắn",
  "chatbot_open_label": "Mở chat",
  "chatbot_close_label": "Đóng chat",
  "footer_coffee_button": "Mời Coffe",
  "coffee_modal_title": "Mời mình một ly cafe!",
  "coffee_modal_close_label": "Đóng",
  "coffee_modal_zalo": "Zalo",
  "coffee_modal_mbbank": "MB Bank",
  "coffee_modal_thanks": "Tri ân sự ủng hộ, giúp app miễn phí tiếp tục được duy trì.",
  "admin_mode_enabled": "Chế độ Quản trị viên đã được kích hoạt.",
  "admin_mode_disabled": "Đã thoát chế độ Quản trị viên.",
  "login_incorrect_password": "Mật khẩu không chính xác. Vui lòng thử lại.",
  "back_button": "Quay lại",

  "guide_title": "Hướng dẫn sử dụng",
  "guide_intro": "Dưới đây là hướng dẫn chi tiết cho từng công cụ và các chức năng trong CTAI Studio.",
  
  "guide_arch_viz_steps": "### Tab Diễn hoạ\n1. Tải lên ảnh phác thảo hoặc mô hình 3D thô (nếu có) để AI bám sát hình dáng.\n2. Nhập mô tả chi tiết về công trình (ví dụ: 'Biệt thự hiện đại 3 tầng, kính lớn, có hồ bơi').\n3. Chọn các thiết lập bổ sung: Bối cảnh (Thành thị/Nông thôn), Thời gian (Ngày/Đêm), Thời tiết.\n4. Nhấn nút 'Tạo ảnh' và chờ AI xử lý.\n### Tab Góc nhìn Sáng tạo\n1. Tải lên một hình ảnh đầu vào (phối cảnh hoặc ảnh chụp).\n2. Chọn tỷ lệ khung hình mong muốn cho ảnh đầu ra.\n3. Nhấn 'Tạo gợi ý Prompt'. AI sẽ phân tích ảnh và sinh ra 30-40 gợi ý góc chụp độc đáo.\n4. Chọn một prompt từ danh sách và nhấn 'Tạo ảnh' để xem kết quả.\n### Tab Cải thiện\n1. Chọn chế độ 'Ngoại thất' hoặc 'Nội thất'.\n2. Tải lên ảnh render cũ hoặc ảnh chất lượng thấp.\n3. Nhấn 'Bắt đầu cải thiện'. AI sẽ tự động thực hiện các bước: Xử lý nền -> Tạo bản vẽ Sketch -> Render lại.\n4. (Tùy chọn) Ở bước cuối, tải thêm ảnh tham chiếu style để AI học theo màu sắc/ánh sáng của ảnh đó.",
  
  "guide_360_steps": "### Chức năng Xem & Điều hướng\n1. Tải lên ảnh Panorama 360 độ (tỷ lệ 2:1, ví dụ: 4096x2048).\n2. Sử dụng chuột (trên máy tính) hoặc chạm vuốt (trên điện thoại) để xoay và nhìn xung quanh.\n### Bảng Điều khiển Camera\n1. Sử dụng các nút Pan (Lên/Xuống/Trái/Phải) để xoay góc nhìn camera tại chỗ.\n2. Sử dụng các nút Orbit (Quay quanh) để di chuyển camera xung quanh điểm nhìn.\n3. Sử dụng nút Zoom để phóng to/thu nhỏ chi tiết.\n4. Nhấn Hoàn tác/Làm lại để quay về các bước chỉnh sửa trước.",
  
  "guide_video_steps": "### Tab Tạo Video\n1. Nhập ý tưởng kịch bản hoặc mô tả video chi tiết vào ô văn bản.\n2. Tải lên ảnh tham chiếu (tùy chọn) để AI hiểu rõ nhân vật hoặc phong cách.\n3. Chọn tỷ lệ khung hình (16:9 Ngang hoặc 9:16 Dọc).\n4. Tích chọn 'Timelapse Xây dựng' nếu muốn tạo video tua nhanh quá trình thi công.\n5. Nhấn 'Tạo Video' và chờ (quá trình này mất khoảng 2-3 phút).\n### Tab DirectorAI (Đạo diễn AI)\n1. Tải lên một hình ảnh chủ đề.\n2. Nhập ý tưởng sơ bộ.\n3. Nhấn 'Phân tích & Phát triển'. AI sẽ đóng vai đạo diễn và viết ra 20 kịch bản phân cảnh chi tiết.\n4. Chọn một kịch bản ưng ý và nhấn nút 'Tạo video' bên cạnh để dựng phim ngay lập tức.",
  
  "guide_edit_steps": "### Sửa vùng chọn (Edit)\n1. Tải lên ảnh cần chỉnh sửa.\n2. Dùng công cụ Cọ vẽ, Lasso hoặc Đa giác để khoanh vùng đối tượng cần sửa/xóa.\n3. Nhập mô tả thay đổi (ví dụ: 'xóa người', 'thêm cây xanh', 'đổi thành cửa gỗ').\n4. Nhấn 'Tạo 1 ảnh'.\n### Sơn nhà\n1. Tải ảnh công trình.\n2. Chọn chức năng 'Sơn nhà'. Khoanh vùng tường cần sơn.\n3. Chọn hãng sơn (Jotun, Dulux...) và màu sắc từ bảng màu chính hãng.\n4. AI sẽ sơn lại tường mà vẫn giữ nguyên bóng đổ và chất liệu bề mặt.\n### Ghép nhà & Thay vật liệu\n1. Chọn chức năng 'Ghép nhà' hoặc 'Thay vật liệu'.\n2. Tải ảnh gốc và một ảnh tham chiếu (chứa ngôi nhà mẫu hoặc vật liệu mẫu).\n3. Khoanh vùng trên ảnh gốc nơi muốn ghép đè lên.\n4. Nhấn tạo để AI hòa trộn hai ảnh.\n### Thay nội thất\n1. Chọn tab 'Thay nội thất'. Tải ảnh phòng trống.\n2. Tải lên ảnh đồ nội thất rời (ghế, bàn...). AI sẽ tự động tách nền đồ vật.\n3. Nhập mô tả vị trí đặt đồ (ví dụ: 'đặt sofa vào giữa phòng').\n### Đồng bộ nhân vật\n1. Tải lên nhiều ảnh bối cảnh (nền).\n2. Tải lên hoặc tạo mới một nhân vật mẫu.\n3. Nhấn 'Đồng bộ'. AI sẽ ghép nhân vật đó vào tất cả các bối cảnh một cách tự nhiên.",
  
  "guide_drawing_steps": "### Tab Bản vẽ kỹ thuật\n1. Tải lên ảnh phối cảnh 3D của công trình.\n2. Chọn loại bản vẽ cần tạo: Mặt bằng, Mặt đứng, hoặc Mặt cắt.\n3. Chọn mức độ chi tiết (Cơ bản, Chi tiết thi công...) và phong cách nét vẽ.\n4. Nhấn 'Tạo bản vẽ' để AI chuyển đổi ảnh 3D thành bản vẽ kỹ thuật 2D.\n### Tab Vẽ Sketchup\n1. Tải lên ảnh mặt bằng 2D.\n2. Chọn các thông số: Phong cách kiến trúc, Vật liệu chủ đạo, Bối cảnh.\n3. Chọn góc nhìn mong muốn (Phối cảnh chim bay, Tầm mắt, Mặt đứng).\n4. Nhấn 'Tạo hình ảnh'. AI sẽ dựng lên hình ảnh mô phỏng 3D theo phong cách Sketchup.",
  
  "guide_luban_steps": "### Tab Thước Lỗ Ban\n1. Nhập kích thước (mm) vào ô Rộng hoặc Cao.\n2. Xem kết quả trực tiếp trên thước: Màu đỏ là cung tốt, màu đen là cung xấu. Đọc ý nghĩa cung bên dưới.\n### Tab Cầu thang\n1. Nhập chiều cao tầng (mm).\n2. Nhấn 'Tính'. Hệ thống sẽ gợi ý số bậc thang rơi vào cung 'Sinh' (4n+1) phù hợp nhất.\n3. Nhấn 'Vẽ' để xem bản vẽ mặt cắt thang chi tiết.\n### Tab Cửa Cổng\n1. Nhập chiều rộng cổng dự kiến.\n2. So sánh với các kích thước đẹp theo phong thủy (Lỗ Ban 52.2cm) được gợi ý sẵn.\n### Tab Ram dốc & Mái nhà\n1. Nhập chiều cao và chiều dài dốc để kiểm tra độ dốc % và nhận đánh giá an toàn.\n2. Nhập chiều rộng mái để tính chiều cao đỉnh mái và độ dốc thoát nước tối ưu.",
  
  "guide_fengshui_steps": "### Tab Bát Trạch\n1. Nhập thông tin gia chủ: Họ tên, Năm sinh, Giới tính.\n2. Tải ảnh mặt bằng nhà. Click lên ảnh để xác định tâm nhà.\n3. Nhấn 'Phân tích'. AI sẽ vẽ đồ hình Bát quái lên mặt bằng và đưa ra luận giải chi tiết.\n### Tab Trạch Mệnh\n1. Nhập thông tin tất cả thành viên trong gia đình.\n2. Tải ảnh khu đất, xác định tâm và hướng.\n3. AI sẽ tư vấn xem hướng nhà đó có hợp với gia chủ và các thành viên không.\n### Tab Loan Đầu & Dương Trạch\n1. Nhập địa chỉ hoặc tải ảnh vệ tinh khu đất.\n2. AI phân tích thế đất (Tứ tượng: Thanh Long, Bạch Hổ...) và hình sát xung quanh.\n3. Kiểm tra bố trí Cửa - Bếp - Ngủ theo phái Dương Trạch Tam Yếu.\n### Các tiện ích khác\n1. **Ngày giờ tốt:** Tìm ngày động thổ, nhập trạch.\n2. **Văn khấn:** Tạo bài văn khấn chuẩn theo phong tục.\n3. **Màu sắc:** Xem màu hợp mệnh.\n4. **Âm trạch:** Phân tích hướng mộ và ngày giờ an táng.",
  
  "guide_planning_steps": "### Tab Tạo Mặt bằng\n1. Tải lên ảnh chụp vệ tinh hoặc bản đồ hiện trạng khu đất.\n2. Sử dụng công cụ vẽ để tô màu khoanh vùng các khu chức năng (Đỏ: Thương mại, Vàng: Ở, Xanh: Cây xanh...).\n3. Chọn loại hình quy hoạch (Khu đô thị, Resort, Công nghiệp...).\n4. Nhấn 'Tạo Mặt bằng' để AI đề xuất phương án phân lô và giao thông.\n### Tab Tạo Phối cảnh 3D\n1. Tải lên ảnh mặt bằng quy hoạch 2D (có thể dùng ảnh vừa tạo ở bước trên).\n2. Chọn phong cách kiến trúc và thời gian (Ngày/Đêm).\n3. Nhấn 'Tạo Phối cảnh' để AI dựng lên hình ảnh 3D tổng thể của khu quy hoạch.",
  
  "guide_costing_steps": "### Tab Dự toán Chi phí\n1. Nhập thông số công trình: Diện tích, số tầng, số phòng, phong cách, địa điểm.\n2. Tải lên các ảnh thiết kế (nếu có) để AI phân tích kỹ hơn.\n3. Nhấn 'Lập dự toán'. AI sẽ xuất ra bảng dự toán chi tiết (Phần thô, Hoàn thiện, Nội thất...).\n### Tab Tư vấn Vật liệu\n1. Nhập ngân sách đầu tư tối đa (ví dụ: 3 tỷ).\n2. Nhấn 'Tư vấn Vật liệu'. AI sẽ đề xuất các chủng loại vật tư phù hợp để không vượt quá ngân sách.\n### Tab Tính diện tích sơn\n1. Nhập kích thước chi tiết của các phòng, cửa đi, cửa sổ.\n2. AI sẽ tính toán chính xác diện tích tường cần sơn và quy đổi ra số lượng thùng sơn/lót cần mua.",
  
  "guide_reference_steps": "### Tab Mật độ xây dựng\n1. Nhập diện tích đất và tỉnh/thành phố.\n2. Nhấn 'Tra cứu'. AI sẽ đối chiếu QCVN 01:2021 để cho biết mật độ xây dựng tối đa và số tầng cho phép.\n### Tab Tra cứu Quy hoạch\n1. Chọn tỉnh thành phố.\n2. Hệ thống sẽ mở đường dẫn đến cổng thông tin quy hoạch chính thống của địa phương đó.\n### Tab Tra cứu PCCC\n1. Chọn loại hình công trình (Nhà ở, Karaoke, Kho xưởng...).\n2. Nhập câu hỏi cụ thể (ví dụ: 'Cầu thang thoát hiểm rộng bao nhiêu?').\n3. AI sẽ trích dẫn các quy chuẩn PCCC hiện hành để trả lời.",
  
  "guide_upscale_steps": "### Nâng cấp ảnh\n1. Tải lên ảnh bị mờ, vỡ hạt hoặc độ phân giải thấp.\n2. Chọn chế độ:\n   - **Nâng cấp Nhanh:** Tăng độ nét cơ bản.\n   - **Nâng cấp Chi tiết (Ultra):** AI tái tạo lại các chi tiết bị mất, khử nhiễu và tăng độ phân giải lên 4K.\n3. Nhấn nút và chờ kết quả. Có thể dùng thanh trượt để so sánh trước/sau.",

  "guide_sun_wind_steps": "### Phân tích\n1. Tải lên ảnh phối cảnh 3D công trình.\n2. Nhập thông tin địa điểm, hướng nhà, mùa và bối cảnh xung quanh.\n3. (Mới) Nhập mô tả bổ sung để AI tập trung phân tích theo ý muốn.\n4. Nhấn 'Tạo Moodboard Phân tích Khí hậu'. AI sẽ tạo ra bản phân tích trực quan bao gồm biểu đồ đường mặt trời, hướng gió và biểu đồ nhiệt.\n### Giải pháp & Phong cách\n1. Sau khi có kết quả phân tích, AI tự động tạo 'Ảnh tham chiếu phong cách' gợi ý xu hướng thiết kế phù hợp khí hậu.\n2. Nhập mô tả giải pháp hoặc để AI tự đề xuất.\n3. Nhấn 'Tạo Phối cảnh Giải pháp' để xem công trình được tối ưu hóa với lam chắn nắng, cây xanh...",
  
  "tool_1_tag": "CÔNG CỤ AI",
  "tool_1_title": "Diễn hoạ kiến trúc",
  "tool_1_desc": "Tạo hình ảnh ngoại thất chân thực.",
  "tool_11_tag": "CÔNG CỤ AI",
  "tool_11_title": "Cải thiện diễn hoạ",
  "tool_11_desc": "Làm đẹp ảnh render, thay đổi phong cách theo mẫu.",
  "tool_2_tag": "CÔNG CỤ AI",
  "tool_2_title": "Tham quan ảo 360°",
  "tool_2_desc": "Xem và tương tác với hình ảnh 360.",
  "tool_3_tag": "CÔNG CỤ AI",
  "tool_3_title": "Video AI (Veo 2)",
  "tool_3_desc": "Tạo video từ văn bản và hình ảnh với Veo 2.",
  "tool_4_tag": "CÔNG CỤ AI",
  "tool_4_title": "AI Chỉnh sửa ảnh",
  "tool_4_desc": "Chỉnh sửa ảnh chuyên nghiệp bằng AI.",
  "tool_5_tag": "CÔNG CỤ AI",
  "tool_5_title": "Bản vẽ kỹ thuật & Sketchup",
  "tool_5_desc": "Tạo bản vẽ kỹ thuật từ 3D và dựng phối cảnh Sketchup từ 2D.",
  "tool_6_tag": "CÔNG CỤ TIỆN ÍCH",
  "tool_6_title": "Thước Lỗ Ban",
  "tool_6_desc": "Tra cứu kích thước phong thủy cho xây dựng và nội thất.",
  "tool_7_tag": "CÔNG CỤ TIỆN ÍCH",
  "tool_7_title": "Phong thủy",
  "tool_7_desc": "Phân tích Bát Trạch, Loan Đầu, xem ngày giờ tốt và các yếu tố phong thủy khác.",
  "tool_8_tag": "CÔNG CỤ AI",
  "tool_8_title": "AI Quy hoạch",
  "tool_8_desc": "Tạo mặt bằng quy hoạch và diễn họa 3D từ 2D.",
  "tool_9_tag": "CÔNG CỤ AI",
  "tool_9_title": "Dự toán",
  "tool_9_desc": "Dự toán chi phí và tư vấn vật liệu.",
  "tool_10_tag": "CÔNG CỤ TIỆN ÍCH",
  "tool_10_title": "AI Tra cứu & Tham khảo",
  "tool_10_desc": "Tra cứu mật độ xây dựng, quy chuẩn, tiêu chuẩn và các thông tin tham khảo khác.",
  "tool_14_tag": "CÔNG CỤ TIỆN ÍCH",
  "tool_14_title": "Hướng Nắng & Gió",
  "tool_14_desc": "Phân tích khí hậu, hướng nắng gió và đề xuất giải pháp kiến trúc."
}
